Tekla Open API Reference for Tekla Structures 2025
Rectangle.Attributes Property
 The attributes of the rectangle.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Rectangle.RectangleAttributes Attributes { get; set; }
Public Property Attributes As Rectangle.RectangleAttributes
	Get
	Set
Property Value
Type: Rectangle.RectangleAttributes
See Also
Reference
Rectangle Class
Tekla.Structures.Drawing Namespace